;记事本右下角显示了该文件的编码，编码必须是 UTF-16 LE 格式，
;如果不是，请使用另存为修改编码格式。

;分离闪避与奔跑按键
[Dodging]

;游戏中的闪避按键
key_in_game=Space

;分离后的闪避按键
key_detached=LShift

;按键切换法术
[Spells]

;游戏中已记忆的法术
;只能使用英文分号';'分隔
equipped_spells=

;分离后的切换法术按键
;只能使用小写字母、只能使用英文分号';'分隔
;假设设置为 a,b,c，则表示按下 a 切换第一个法术、按下 b 切换第二个法术…
key_detached=F1;F2;F3;;;;;;;

;游戏中的切换法术按键
;只能使用小写字母
switch_spell_button=Up

;游戏中法术名称在屏幕内的像素坐标范围 (左、上、右、下)
spell_name_region=

;按键切换消耗品
[Items]

;游戏中已装备的消耗品
;只能使用英文分号';'分隔
equipped_items=

;分离后的切换消耗品按键
;只能使用小写字母、只能使用英文分号';'分隔
;假设设置为 a,b,c，则表示按下 a 切换第一个消耗品、按下 b 切换第二个消耗品…
key_detached=Numpad1;Numpad2;Numpad3;Numpad4;Numpad5;Numpad6;Numpad7;Numpad8;Numpad9;NumpadAdd

;游戏中的切换消耗品按键
;只能使用小写字母
switch_item_button=Down

;游戏中消耗品名称在屏幕内的像素坐标范围 (左、上、右、下)
item_name_region=

[Equipment]
equipment_region=
config1=;;
config2=;;
config3=;;
config4=;;
config5=;;
config6=;;
config7=;;
config8=;;
config9=;;

[KeyMap]
config1=;
config2=;
config3=;
config4=;
config5=;
config6=;
config7=;
config8=;
config9=;
config10=;

[Common]
;切换法术和物品时，两次切换的时间间隔
;数值越低，切换速度越快，但可能因为游戏掉帧而导致切换不准确
;至少设置为 30 以上
click_interval=40

menu_button=Esc

confirm_button=e

enabled=0

[Resolution]
Spell_1920_1080=230;635;410;665
Item_1920_1080=230;990;410;1020
Eqp_1920_1080=135;230;660;880

Spell_2560_1440=300;845;480;855
Item_2560_1440=300;1320;480;1360
Eqp_2560_1440=170;320;870;1180

;Spell_3840_2160=
;Item_3840_2160=
;Eqp_3840_2160=

